# InfillNoThicknessMultiface Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InfillNoThicknessMultiface Property
BuiltInFailures..::..InfillFailures Class See Also
---
Highlighted infilling element could not have thickness different from its host because it spans multiple faces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InfillNoThicknessMultiface { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfillNoThicknessMultiface As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InfillNoThicknessMultiface {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace